name: "FaceNet"
layers {
  name: "face"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 120
    new_width: 120
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 120
    #mirror: true
  }
  include: { phase: TRAIN }
}
layers {
  name: "face"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 120
    new_width: 120
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #mirror: true
  }
  include: { phase: TEST }
}

layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 48
    kernel_size: 9
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 8
    stride: 8
  }
}

layers {
  name: "ip1"
  type: INNER_PRODUCT
  bottom: "pool1"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "ip2"
  type: INNER_PRODUCT
  bottom: "ip1"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}

layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}


