name: "FaceNet"
layers {
  name: "face"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 128
    new_width: 128
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TRAIN }
}
layers {
  name: "face"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 128
    new_width: 128
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TEST }
}

layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 8
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 8
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "face1"
  type: IMAGE_DATA
  top: "data2"
  top: "label1"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 64
    new_width: 64
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TRAIN }
}

layers {
  name: "face1"
  type: IMAGE_DATA
  top: "data2"
  top: "label1"
  image_data_param {
    source: "data/face_feature_extraction/test.txt"
    batch_size: 64
    new_height: 64
    new_width: 64
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TEST }
}

layers {
  name: "conv2_1"
  type: CONVOLUTION
  bottom: "data2"
  top: "conv2_1"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 8
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layers {
  name: "concat"
  bottom: "conv2"
  bottom: "conv2_1"
  top: "out1"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}

layers {
  name: "pool2"
  type: POOLING
  bottom: "out1"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 8
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

#######

layers {
  name: "face2"
  type: IMAGE_DATA
  top: "data3"
  top: "label2"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 32
    new_width: 32
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TRAIN }
}

layers {
  name: "face2"
  type: IMAGE_DATA
  top: "data3"
  top: "label2"
  image_data_param {
    source: "data/face_feature_extraction/test.txt"
    batch_size: 64
    new_height: 32
    new_width: 32
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TEST }
}

layers {
  name: "conv2_2"
  type: CONVOLUTION
  bottom: "data3"
  top: "conv2_2"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 8
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layers {
  name: "concat"
  bottom: "conv3"
  bottom: "conv2_2"
  top: "out2"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}

layers {
  name: "pool3"
  type: POOLING
  bottom: "out2"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "pool3"
  top: "conv4"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 7
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

###



layers {
  name: "face3"
  type: IMAGE_DATA
  top: "data4"
  top: "label3"
  image_data_param {
    source: "data/face_feature_extraction/train.txt"
    batch_size: 64
    new_height: 16
    new_width: 16
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TRAIN }
}

layers {
  name: "face3"
  type: IMAGE_DATA
  top: "data4"
  top: "label3"
  image_data_param {
    source: "data/face_feature_extraction/test.txt"
    batch_size: 64
    new_height: 16
    new_width: 16
  }
  transform_param {
    #scale: 0.00390625
    #crop_size: 89
    #crop_size: 119
    #mirror: true
  }
  include: { phase: TEST }
}

layers {
  name: "conv2_3"
  type: CONVOLUTION
  bottom: "data4"
  top: "conv2_3"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 7
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layers {
  name: "concat"
  bottom: "conv4"
  bottom: "conv2_3"
  top: "out3"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}

layers {
  name: "pool4"
  type: POOLING
  bottom: "out3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layers {
  name: "conv5"
  type: CONVOLUTION
  bottom: "pool4"
  top: "conv5"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layers {
  name: "pool5"
  type: POOLING
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}



layers {
  name: "ip2"
  type: INNER_PRODUCT
  bottom: "pool5"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}

layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}


